# AirViscosity Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DuctFittingAndAccessoryData..::..AirViscosity Property
DuctFittingAndAccessoryData Class See Also
---
The air viscosity of the duct fitting or duct accessory, Units: (kg/(ft·s)).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double AirViscosity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AirViscosity As Double
	Get
```

Visual C++
---
```text
public:
property double AirViscosity {
	double get ();
}
```

# See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace